In [1]:
#Series
import pandas as pd
x = [3,4,5,6,7,8]
var = pd.Series(x)
print(var)
print(type(var))
print(var[2])

0    3
1    4
2    5
3    6
4    7
5    8
dtype: int64
<class 'pandas.core.series.Series'>
5

In [2]:
y = [4,5,6,8]
y_var = pd.Series(y, index=['a', 's', 'd', 'f'], dtype='float', name='python')
print(y_var)

a    4.0
s    5.0
d    6.0
f    8.0
Name: python, dtype: float64

In [3]:
dic = {"name":['python','c','c++','java'], "por":[12,13,14,15], "rank":[1,4,3,2]}
var1 = pd.Series(dic)
print(var1)

name    [python, c, c++, java]
por           [12, 13, 14, 15]
rank              [1, 4, 3, 2]
dtype: object

In [4]:
s = pd.Series(12, index=[1,2,3,4,5,6,7])
print(s)
print(type(s))

1    12
2    12
3    12
4    12
5    12
6    12
7    12
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
s1 = pd.Series(12, index=[1,2,3,4,5,6,7])
s2 = pd.Series(12, index=[1,2,3,4])
print(s1+s2)

1    24.0
2    24.0
3    24.0
4    24.0
5     NaN
6     NaN
7     NaN
dtype: float64

In [6]:
#DataFrame
import pandas as pd
l = [1,2,3,4,5,6]
df = pd.DataFrame(l)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   0
0  1
1  2
2  3
3  4
4  5
5  6

In [7]:
d = {"a":[1,2,3,4,5],"b":[1,2,3,4,5],"c":[1,2,3,4,5]}
df1 = pd.DataFrame(d,columns=["a","b"])
df2 = pd.DataFrame(d,columns=["a","b"], index=["a","s","d","f","g"])
print(type(df1))
print(df1)
print(type(df2))
print(df2)

<class 'pandas.core.frame.DataFrame'>
   a  b
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5
<class 'pandas.core.frame.DataFrame'>
   a  b
a  1  1
s  2  2
d  3  3
f  4  4
g  5  5

In [8]:
d = {"a":[1,2,3,4,5],"b":[1,2,3,4,5],"c":[1,2,3,4,5]}
dataframe = pd.DataFrame(d)
print(dataframe)
print(dataframe["c"][4])

   a  b  c
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5
5

In [9]:
list_1 = [[1,3,5,6],[2,4,6,8]]
var_2 = pd.DataFrame(list_1)
print(type(var_2))
print(var_2)

<class 'pandas.core.frame.DataFrame'>
   0  1  2  3
0  1  3  5  6
1  2  4  6  8

In [10]:
sr = {"d":pd.Series([1,2,3,4]),"r":pd.Series([5,6,7,8])}
var_3 = pd.DataFrame(sr)
print(type(var_3))
print(var_3)

<class 'pandas.core.frame.DataFrame'>
   d  r
0  1  5
1  2  6
2  3  7
3  4  8

In [11]:
#Arithmetic-Operation
import pandas as pd
x = pd.DataFrame({"A":[5,6,7,8,9],"B":[2,4,6,8,10]},index=['a','s','d','f','g'])
print(x)

   A   B
a  5   2
s  6   4
d  7   6
f  8   8
g  9  10

In [12]:
x["C"] = x["A"] + x["B"]
x

   A   B   C
a  5   2   7
s  6   4  10
d  7   6  13
f  8   8  16
g  9  10  19

In [13]:
x["C"] = x["A"] - x["B"]
x

   A   B  C
a  5   2  3
s  6   4  2
d  7   6  1
f  8   8  0
g  9  10 -1

In [14]:
x["C"] = x["A"] * x["B"]
x

   A   B   C
a  5   2  10
s  6   4  24
d  7   6  42
f  8   8  64
g  9  10  90

In [15]:
x["C"] = x["A"] / x["B"]
x

   A   B         C
a  5   2  2.500000
s  6   4  1.500000
d  7   6  1.166667
f  8   8  1.000000
g  9  10  0.900000

In [16]:
x1 = pd.DataFrame({"A":[10,20,30,40],"B":[15,25,35,45]})
x1

    A   B
0  10  15
1  20  25
2  30  35
3  40  45

In [17]:
x1["Python"] = x1["A"] <= 20
x1

    A   B  Python
0  10  15    True
1  20  25    True
2  30  35   False
3  40  45   False

In [18]:
#Insert 
import pandas as pd
var_4 = pd.DataFrame({"A":[1,2,3,4,5],"B":[6,7,8,9,10]})
var_4

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [19]:
var_4.insert(2,"python",var_4["A"])
print(var_4)

   A   B  python
0  1   6       1
1  2   7       2
2  3   8       3
3  4   9       4
4  5  10       5

In [20]:
var_4.insert(2,"python_1",[11,12,13,14,15])
var_4

   A   B  python_1  python
0  1   6        11       1
1  2   7        12       2
2  3   8        13       3
3  4   9        14       4
4  5  10        15       5

In [23]:
var_4["python12"] = var_4["A"][:3]
var_4

   A   B  python_1  python  python12
0  1   6        11       1       1.0
1  2   7        12       2       2.0
2  3   8        13       3       3.0
3  4   9        14       4       NaN
4  5  10        15       5       NaN

In [25]:
#Delete
var_5 = var_4.pop("B")
var_5

0     6
1     7
2     8
3     9
4    10
Name: B, dtype: int64

In [ ]:
var_4
#Table which do not include deleted column

   A  python_1  python  python12
0  1        11       1       1.0
1  2        12       2       2.0
2  3        13       3       3.0
3  4        14       4       NaN
4  5        15       5       NaN

In [ ]:
#creating a csv file
import pandas as pd
dis = {"a":[1,2,3,4,5],"b":[6,7,8,9,10],"f":[1,2,3,4,5]}
d = pd.DataFrame(dis)
print(d)
d.to_csv("test_new.csv",index=False,header=["a_1","a_2","a_3"])

   a   b  f
0  1   6  1
1  2   7  2
2  3   8  3
3  4   9  4
4  5  10  5